accountsProxy/accountsProxy/src/gateway/duMockTargetServer/apiproxy/resources/node/du-mocks/trouble-tickets/GetTTInfo-Res.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.webservices.com/LCE/Du/WebServices" xmlns:head="http://www.du.ae/LCE/HeaderResponse" xmlns:lcew="http://xmlns.du.ae/LCE/Business/LCEWebServiceResponse" xmlns:get="http://xmlns.du.ae/LCE/Business/RequestManagement/GetTTInfo">
   <soapenv:Header/>
   <soapenv:Body>
      <web:GetTTInfoResponse>
         <Response>
            <head:Header>
               <!--Optional:-->
               <head:RequestId>?</head:RequestId>
               <!--Optional:-->
               <head:CorrelationId>?</head:CorrelationId>
               <head:ResponseCode>?</head:ResponseCode>
               <!--Optional:-->
               <head:ResponseMessage>?</head:ResponseMessage>
               <!--Optional:-->
               <head:ErrorCode>?</head:ErrorCode>
               <!--Optional:-->
               <head:ErrorDescription>?</head:ErrorDescription>
            </head:Header>
            <!--Optional:-->
            <lcew:Body>
               <!--Zero or more repetitions:-->
               <get:TTInfo>
                  <!--Optional:-->
                  <get:Reference>?</get:Reference>
                  <!--Optional:-->
                  <get:DateCreated>?</get:DateCreated>
                  <!--Optional:-->
                  <get:RequestType>?</get:RequestType>
                  <!--Optional:-->
                  <get:ServiceType>?</get:ServiceType>
                  <!--Optional:-->
                  <get:PlanType>?</get:PlanType>
                  <!--Optional:-->
                  <get:Status>?</get:Status>
               </get:TTInfo>
            </lcew:Body>
         </Response>
      </web:GetTTInfoResponse>
   </soapenv:Body>
</soapenv:Envelope>
